[
    {
        "question_1": "What happens at the end of my free trial?",
        "answer_1": "At the end of your free trial, your membership will automatically renew and you will be charged for a subscription on a monthly or annual basis (depending on the billing option you choose) unless you cancel. You can cancel at any time prior to the renewal at BytesGo.app/payment"
    },
    {
        "question_2": "Can I change or cancel my plan later on?",
        "answer_2": "Yes. You can upgrade or cancel anytime from your settings page. When you cancel, you will lose your Premium features at the end of your billing cycle. Be sure you use all your InMail messages before the cancellation goes into effect."
    },
    {
        "question_3": "How will you bill me?",
        "answer_3": "We offer monthly billing and in some cases annual billing. Depending on what option you choose, your membership will be renewed at the end of each month or at the end of each year. If you choose to pay annually, you could save up to 33% compared to paying monthly."
    },
    {
        "question_4": "How are Premium Insights derived and how frequently are they updated?",
        "answer_4": "We collect, organize, and develop insights on companies based on profile information of LinkedIn members. Information is updated on a weekly basis. LinkedIn does not guarantee comprehensiveness and accuracy of data or insights."
    },
    {
        "question_5": "What is your refund policy?",
        "answer_5": "LinkedIn does not offer refunds except in certain situations and jurisdictions, as noted in our REPORT documents."
    },
    {
        "question_6": "Can I expense my Premium membership?",
        "answer_6": "Many employers find LinkedIn Premium so valuable that they’ll pay for their employees’ memberships. After your purchase, you’ll receive the receipt in your email that you can use to file an expense report."
    },
    {
        "question_7": "What should I know about InMail credits, job credits, profile viewers, and people browsing?",
        "answer_7": "InMail credits expire after 90 days. If you cancel your upgraded account, any unused InMail credits will be valid only until the end of your current billing cycle. If you cancel your Recruiter Lite or Recruiter Corporate account, any unused job credits you have will be transferred to your personal LinkedIn.com account at the end of your current billing cycle. For Who’s Viewed Your Profile, first and last name may not be listed for profile viewers who have chosen to remain semi- or fully-anonymous via their privacy settings. Certain search and browsing restrictions apply if an unusually high number of queries are executed in a short time period, in order to prevent system abuse."
    }
]